src/DataProcessors/ИС_Ozon_ВыгрузкаКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_Ozon_ВыгрузкаКарточек</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеОсновныхРеквизитовТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеОсновныхРеквизитовТовара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Множитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеЗначенийХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеЗначенийХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРеквизита1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ВидРеквизитаСопоставления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизит1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристикиOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_ЗначенияХарактеристик</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ИС_Ozon_КатегорииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_КатегорииТоваров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертифицируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type_id</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аспектная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_Ozon_ВыгрузкаКарточек/Forms/ФормаКопированияСопоставленияХарактеристик/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Категория", Категория);
	Параметры.Свойство("СопоставлениеОсновныхРеквизитов", СопоставлениеОсновныхРеквизитов);

	Если СопоставлениеОсновныхРеквизитов Тогда
		ЗаполнитьОсновныеРеквизитыТовара();
		Элементы.ПредставлениеРеквизитаТовара.Видимость = Истина;
		Элементы.Характеристика.Видимость 				= Ложь;
		;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияИсточникПриИзменении(Элемент)

	КатегорияИсточникПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)

	СкопироватьНаСервере();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)

	УстановитьПризнак(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)

	УстановитьПризнак(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КатегорияИсточникПриИзмененииНаСервере()

	Если Не СопоставлениеОсновныхРеквизитов Тогда

		//Ozon_Константы 	= Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();
		ХарактеристикиOzonСИндивидуальнымиЗначениямиДляКатегории = Новый Массив;
		//ИС_Ozon_Сервер.СсылкиНаСправочникИзСтроки(
		//	Ozon_Константы.ЗначенияПоИменам.ХарактеристикиOzonСИндивидуальнымиЗначениямиДляКатегории, "ИС_Ozon_Характеристики");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ХарактеристикиКатегории
		|ИЗ
		|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
		|ГДЕ
		|	НЕ Ozon_КатегорииТоваровХарактеристики.Характеристика В(&ХарактеристикиСИндивидуальнымЗначением)
		|	И Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ozon_КатегорииТоваровХарактеристики.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ХарактеристикиКатегорииИсточника
		|ИЗ
		|	Справочник.ИС_Ozon_КатегорииТоваров.Характеристики КАК Ozon_КатегорииТоваровХарактеристики
		|ГДЕ
		|	НЕ Ozon_КатегорииТоваровХарактеристики.Характеристика В(&ХарактеристикиСИндивидуальнымЗначением)
		|	И Ozon_КатегорииТоваровХарактеристики.Ссылка = &Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ХарактеристикиКатегории.Характеристика КАК Характеристика,
		|	ЛОЖЬ КАК Копировать
		|ИЗ
		|	вт_ХарактеристикиКатегории КАК вт_ХарактеристикиКатегории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ХарактеристикиКатегорииИсточника КАК вт_ХарактеристикиКатегорииИсточника
		|		ПО вт_ХарактеристикиКатегории.Характеристика = вт_ХарактеристикиКатегорииИсточника.Характеристика";

		Запрос.УстановитьПараметр("Категория", Категория);
		Запрос.УстановитьПараметр("КатегорияИсточник", КатегорияИсточник);
		Запрос.УстановитьПараметр("ХарактеристикиСИндивидуальнымЗначением",
			ХарактеристикиOzonСИндивидуальнымиЗначениямиДляКатегории);

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		КопируемыеСопоставленияХарактеристик.Загрузить(РезультатЗапроса);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнак(Признак)

	Для Каждого стр Из КопируемыеСопоставленияХарактеристик Цикл

		стр.Копировать = Признак;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновныеРеквизитыТовара()

	ТЗ = КопируемыеСопоставленияХарактеристик.Выгрузить();
	ТаблицаРеквизитов = ИС_Ozon_Сервер.ЗаполнитьТаблицуОсновныхРеквизитов(ТЗ, КатегорияИсточник);

	КопируемыеСопоставленияХарактеристик.Загрузить(ТаблицаРеквизитов);

КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере()

	Если СопоставлениеОсновныхРеквизитов Тогда
		РегистрСоответствия = РегистрыСведений.ИС_Ozon_СоответствиеОсновныхРеквизитовТовара;
		РеквизитОтбораРегистра = "РеквизитТовара";
		РеквизитТЧ = "РеквизитТовара";
	Иначе
		РегистрСоответствия = РегистрыСведений.ИС_Ozon_СоответствиеЗначенийХарактеристик;
		РеквизитОтбораРегистра = "ХарактеристикаOzon";
		РеквизитТЧ = "Характеристика";
	КонецЕсли;

	НаборЗаписейИсточник = РегистрСоответствия.СоздатьНаборЗаписей();
	НаборЗаписейИсточник.Отбор.Категория.Установить(КатегорияИсточник);

	НаборЗаписейПриемник = РегистрСоответствия.СоздатьНаборЗаписей();
	НаборЗаписейПриемник.Отбор.Категория.Установить(Категория);

	Для Каждого стр Из КопируемыеСопоставленияХарактеристик Цикл

		Если стр.Копировать Тогда

			НаборЗаписейИсточник.Отбор[РеквизитОтбораРегистра].Установить(стр[РеквизитТЧ]);
			НаборЗаписейИсточник.Прочитать();

			НаборЗаписейПриемник.Отбор[РеквизитОтбораРегистра].Установить(стр[РеквизитТЧ]);
			НаборЗаписейПриемник.Прочитать();
			НаборЗаписейПриемник.Очистить();

			Для Каждого ЗаписьИсточник Из НаборЗаписейИсточник Цикл
				НоваяЗапись = НаборЗаписейПриемник.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьИсточник);
				НоваяЗапись.Категория = Категория;
			КонецЦикла;

			НаборЗаписейПриемник.Записать(Истина);

		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

#КонецОбласти
